-- phpMyAdmin SQL Dump
-- version 4.9.5
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: 15 มี.ค. 2022 เมื่อ 07:01 AM
-- เวอร์ชันของเซิร์ฟเวอร์: 10.5.12-MariaDB
-- PHP Version: 7.3.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `id18616947_pc_std`
--

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `tb_study`
--

CREATE TABLE `tb_study` (
  `id` int(11) NOT NULL,
  `st_class` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '*ระดับชั้น / ห้อง',
  `st_day` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'วันที่เรียน',
  `st_period` int(11) NOT NULL COMMENT 'คาบที่',
  `st_sub` varchar(11) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ชื่อวิชา',
  `st_tc` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ชื่อผู้สอน',
  `st_room` varchar(10) COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'ห้องเรียน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- dump ตาราง `tb_study`
--

INSERT INTO `tb_study` (`id`, `st_class`, `st_day`, `st_period`, `st_sub`, `st_tc`, `st_room`) VALUES
(1, '4/2', 'จันทร์', 1, 'ว30281', 'พุทธพร', 'คอม 1'),
(2, '4/3', 'จันทร์', 1, 'ค30103 ', 'นิตตรา', '228'),
(3, '4/2', 'จันทร์', 2, 'ว30221', 'จิราภา', '128'),
(4, '4/2', 'จันทร์', 3, 'ค30103', 'นิตตรา', '128'),
(5, '4/2', 'จันทร์', 4, 'ท30102', 'ูขนิษฐา', '211'),
(6, '4/2', 'จันทร์', 5, 'ว30162', 'ดวงใจ', '126'),
(7, '4/2', 'จันทร์', 6, 'ว30162', 'ดวงใจ', '126'),
(8, '4/2', 'จันทร์', 7, 'พ3010', 'พิมศิริ', 'ศ.กีฬา 1'),
(9, '4/2', 'จันทร์', 8, 'พก.2', '', 'ตามกลุ่ม'),
(10, '4/2', 'อังคาร', 1, ' ว30285', 'ณัฐภัสสร', '134'),
(11, '4/2', 'อังคาร', 2, 'ว30285', 'ณัฐภัสสร', '134'),
(12, '4/2', 'อังคาร', 3, 'อ30102', 'ศิริรัตน์', '238'),
(13, '4/2', 'อังคาร', 4, 'ค30103 ', 'นิตตรา', '228'),
(14, '4/2', 'อังคาร', 5, 'ชุมนุม', '', 'ตามกลุ่ม'),
(15, '4/2', 'อังคาร', 6, 'บำเพ็ญฯ ', '', 'ตามกลุ่ม'),
(16, '4/2', 'พุธ', 1, 'ว30214', 'ปิยะมาศ', '125'),
(17, '4/2', 'พุธ', 2, 'ว30214', 'ปิยะมาศ', '125'),
(18, '4/2', 'พุธ', 3, 'ส30102', 'พิมพ์ใจ', '245'),
(20, '4/3', 'จันทร์', 2, 'ท30102', 'ขนิษฐา', '211'),
(21, '4/3', 'จันทร์', 3, 'ว30241', 'ปิยะมาศ', '125'),
(22, '4/3', 'จันทร์', 3, 'ว30241', 'ปิยะมาศ', '125'),
(23, '4/2', 'พฤหัสบดี', 1, 'ส30102 ', 'ครูพิมพ์ใจ ', '245'),
(24, '4/3', 'จันทร์', 5, 'ว30161', 'วีระพล', '136'),
(25, '4/2', 'พฤหัสบดี', 2, 'ค30103 ', 'ครูนิตตรา ', '228'),
(26, '4/3', 'จันทร์', 6, 'อ30102', 'อรรถภูมิ', '238'),
(27, '4/2', 'พฤหัสบดี', 3, 'ว30221 ', 'ครูจิราภา ', '128'),
(28, '4/2', 'พฤหัสบดี', 4, 'ว30221 ', 'ครูจิราภา ', '128'),
(29, '4/2', 'พฤหัสบดี', 5, 'ว30214 ', 'ครูปิยะมาศ ', '125'),
(30, '4/3', 'จันทร์', 7, 'ว30201', 'ณัฐภัสสร', '134'),
(31, '4/2', 'พฤหัสบดี', 6, 'อ30102 ', 'ครูศิริรัตน์ ', '238'),
(32, '4/3', 'จันทร์', 8, 'พก.2', '', 'ตามกลุ่ม'),
(33, '4/2', 'พฤหัสบดี', 7, 'ว30201 ', 'ครูณัฐภัสสร ', '134'),
(34, '4/3', 'อังคาร', 1, 'ค30103', 'นิตตรา', '228'),
(35, '4/2', 'พฤหัสบดี', 8, 'ว30284 ', 'ตามกลุ่ม', ''),
(36, '4/2', 'ศุกร์', 1, 'อ30102 ', 'ครูศิริรัตน์ ', '238'),
(37, '4/3', 'อังคาร', 2, 'ท30102', 'ขนิษฐา', '211'),
(38, '4/2', 'ศุกร์', 2, 'ค30103 ', ' ครูนิตตรา ', '228'),
(39, '4/2', 'ศุกร์', 3, 'ว30161', ' ครูวีระพล ', '136'),
(40, '4/2', 'ศุกร์', 4, 'ว30284 ', ' ครูทวีศักดิ์ ', '123'),
(41, '4/3', 'อังคาร', 3, 'ว30162', 'ดวงใจ', '126'),
(42, '4/2', 'ศุกร์', 5, 'ว30201 ', ' ครูณัฐภัสสร', ' 134'),
(43, '4/3', 'อังคาร', 4, 'ว30162', 'ดวงใจ', '126'),
(44, '4/2', 'ศุกร์', 6, 'ว30201 ', 'ครูณัฐภัสสร ', ' 134'),
(45, '4/3', 'อังคาร', 5, 'ชุมนุม', '', 'ตามกลุ่ม'),
(46, '4/2', 'ศุกร์', 7, 'อ30102 ', 'T.Will', ' 236'),
(47, '4/3', 'อังคาร', 6, 'บำเพ็ญฯ', '', 'ตามกลุ่ม'),
(48, '4/2', 'ศุกร์', 8, 'ศ30102', ' ครูณัฐพล', ' ศ.กีฬา 2'),
(49, '4/2', 'พุธ', 4, 'ท30102', ' ครูขนิษฐา ', '211'),
(50, '4/3', 'พุธ', 1, 'ว30281', 'พุทธพร', 'คอม 1'),
(51, '4/2', 'พุธ', 5, 'ว30281', ' ครูพุทธพร', ' คอม 1'),
(52, '4/3', 'พุธ', 2, 'ว30281', 'พุทธพร', 'คอม 1'),
(53, '4/2', 'พุธ', 6, 'ว30281', ' ครูพุทธพร', ' คอม 1'),
(54, '4/2', 'พุธ', 7, 'อ30102 ', ' T.Will', ' 236'),
(55, '4/3', 'พุธ', 3, 'ค30103', 'นิตตรา', '228'),
(56, '4/2', 'พุธ', 8, 'อ30102 ', 'ครูศิริรัตน์ ', '238'),
(57, '4/3', 'พุธ', 4, 'อ30102', 'อรรถภูมิ', '238'),
(58, '4/3', 'พุธ', 5, 'ว30221', 'จิราภา', '128'),
(59, '4/3', 'พุธ', 6, 'ว30221', 'จิราภา', '128'),
(63, '4/3', 'พุธ', 7, 'ศ30102', 'ณัฐพล', 'ศ.กีฬา 2'),
(67, '4/3', 'พุธ', 8, 'อ30102', 'T.Will', '236'),
(69, '4/3', 'ศุกร์', 1, 'ว30284', 'จิราภา', '128'),
(70, '4/3', 'ศุกร์', 2, 'อ30102', 'อรรถภูมิ', '238'),
(71, '4/3', 'ศุกร์', 3, 'ว30285', 'ณัฐภัสสร', '134'),
(72, '4/3', 'ศุกร์', 4, 'ว30285', 'ณัฐภัสสร', '134'),
(73, '4/3', 'ศุกร์', 5, 'ว30241', 'ปิยะมาศ', '125'),
(74, '4/3', 'ศุกร์', 6, 'ส30102', 'พิมพ์ใจ', '245'),
(75, '4/3', 'ศุกร์', 7, 'ว30281', 'พุทธพร', 'คอม 1'),
(76, '4/3', 'ศุกร์', 8, 'พ30102', 'พิมศิริ', 'ศ.กีฬา 1'),
(78, '4/3', 'พฤหัสบดี', 1, 'ว30201 ', 'ครูณัฐภัสสร ', '134'),
(79, '4/3', 'พฤหัสบดี', 2, 'ว30201 ', 'ครูณัฐภัสสร ', '134'),
(80, '4/3', 'พฤหัสบดี', 3, 'ส30102 ', 'ครูพิมพ์ใจ ', '245'),
(81, '4/3', 'พฤหัสบดี', 4, 'อ30102 ', 'ครูอรรถภูมิ ', '238'),
(82, '4/3', 'พฤหัสบดี', 5, 'ว30221 ', ' ครูจิราภา ', '128'),
(83, '4/3', 'พฤหัสบดี', 6, 'อ30102 ', ' T.Will ', '236'),
(84, '4/3', 'พฤหัสบดี', 7, 'ค30103 ', 'ครูนิตตรา ', '228'),
(85, '4/3', 'พฤหัสบดี', 8, 'ว30284 ', 'ตามกลุ่ม', '');

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `tb_subject`
--

CREATE TABLE `tb_subject` (
  `id` int(11) NOT NULL,
  `sub_id` varchar(100) NOT NULL,
  `sub_name` varchar(100) NOT NULL,
  `sub_tc` int(100) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `tb_teacher`
--

CREATE TABLE `tb_teacher` (
  `id` int(11) NOT NULL,
  `teach_name` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL,
  `teach_sub` varchar(100) COLLATE utf8mb4_unicode_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- โครงสร้างตาราง `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(80) NOT NULL,
  `name` varchar(80) NOT NULL,
  `password` varchar(80) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- dump ตาราง `users`
--

INSERT INTO `users` (`id`, `username`, `name`, `password`) VALUES
(1, 'admin', 'admin', '@admin'),
(2, 'root', 'root', 'root');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_study`
--
ALTER TABLE `tb_study`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tb_subject`
--
ALTER TABLE `tb_subject`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tb_teacher`
--
ALTER TABLE `tb_teacher`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `tb_study`
--
ALTER TABLE `tb_study`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=86;

--
-- AUTO_INCREMENT for table `tb_subject`
--
ALTER TABLE `tb_subject`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `tb_teacher`
--
ALTER TABLE `tb_teacher`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
